In [163]:
import pandas as pd 
import dtale
from faker import Faker
from pivottablejs import pivot_ui    # visualisation sous forme de power BI
import pygwalker as pyg        # visualisation sous forme de power BI
# from ydata_profiling import profileReport    # ERREUR d'installation

In [131]:
data = pd.read_csv("customers.csv")
data.head()

  client_id sex  birth
0    c_4410   f   1967
1    c_7839   f   1975
2    c_1699   f   1984
3    c_5961   f   1962
4    c_5320   m   1943

In [132]:
# toujour effectu√© une copy avant d'appliqu√© la fonction "dtale"

df = data.copy()

### La fonction dtale permet de visualis√© les differentes de notre table sur le site dtale

In [133]:
"""
data_viz = dtale.show(df)
data_viz.open_browser()    # cette ligne de code permet d'ouvrire "dtale" pour visualiser les caracteristiques des donn√©es
"""

'\ndata_viz = dtale.show(df)\ndata_viz.open_browser()    # cette ligne de code permet d\'ouvrire "dtale" pour visualiser les caracteristiques des donn√©es\n'

In [134]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8623 entries, 0 to 8622
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  8623 non-null   object
 1   sex        8623 non-null   object
 2   birth      8623 non-null   int64
dtypes: int64(1), object(2)
memory usage: 202.2+ KB

### Ici je vais transformer la variable cat√©gorielle sex en variable numerique

#### On peu le faire pour les variables avec deux differentes cat√©gories et trois differentes cat√©gorie aussi

In [135]:
set(df["sex"])

{'f', 'm'}

In [136]:
# on va appliqu√© la fonction "cat.codes" pour faire la transformation
# cette transformation peu aider pour le machine learning ou deep learning, parce qu'on utilise des donn√©es numerique

df["sex"] = df["sex"].astype("category").cat.codes

In [137]:
set(df["sex"])

{0, 1}

In [138]:
df.head()

  client_id  sex  birth
0    c_4410    0   1967
1    c_7839    0   1975
2    c_1699    0   1984
3    c_5961    0   1962
4    c_5320    1   1943

### Comment g√©n√©rer des donn√©es d'echantion professionneles avec FAKER

### FAKER

#### On va importer faker et on va g√©n√©rer des adress, zip_cod, nom ...etc

In [139]:
from faker import Faker

In [140]:
# on peu precis√© dans l'argument faker la "langue" pour g√©n√©rer en francais ou en anglais ou encore en ...
# par defaut c'est en anglais, pas besoin de precis√© l'argument ("fr_FR"), on met rien.

faker = Faker("fr_FR")

In [141]:
# On va g√©n√©rer les donn√©es avec la fonction facker

print(faker.name())
print(faker.email())
print(faker.text())
print(faker.sentence())
print(faker.word())
print(faker.words())
print(faker.emoji())
print(faker.ipv4_private())
print(faker.ipv4_public())
print(faker.phone_number())
print(faker.country())
print(faker.date())
print(faker.city())
print(faker.url())
# print(faker.zipcod())   # cette fonction zipcod n'est pris en compte pour la france c'est pour cela j'ai comment√©
print(faker.year())
print(faker.ipv6())
print(faker.mac_address())

Thomas Sanchez
vbourdon@example.org
Tellement r√©p√©ter dont chose glisser nous. Na√Ætre temp√™te d√©j√†.
Danser marquer masse bout quart. Or vue contraire √©tendre. Petit grand preuve.
Acheter nom boire c√¥te sans rose surtout.
Changement vers vert t√¥t impossible.
go√ªt
['surtout', 'entra√Æner', 'faute']
ü¶πüèª‚Äç‚ôÄÔ∏è
172.22.184.250
133.102.119.108
05 57 66 73 28
Croatie
2000-04-24
Briand
http://www.mallet.com/
2019
bfd1:52ff:3b7a:546f:63d9:4869:8aa6:4039
c4:d9:a3:5c:8b:ae

### On va appliqu√© a un cas r√©el pour fournir des nom de clients a notre dataframe "df"

In [142]:
df.head()

  client_id  sex  birth
0    c_4410    0   1967
1    c_7839    0   1975
2    c_1699    0   1984
3    c_5961    0   1962
4    c_5320    1   1943

In [143]:
df.shape

(8623, 3)

In [144]:
def input_data(x):
    data = pd.DataFrame()         # pour avoir un forma dataframe
    for i in range(0, x):             # la boucle for pour generer nos nombre de ligne de nom
        data.loc[i,"name"] = faker.name()      # pour parcouri nos nombre de ligne et nomm√© la colonne "name"
    return data                                   # on retoure la variable data cr√©√©

df1 = input_data(8623)                               # on fait appel a la fonction input_data en creant une variable df1

In [145]:
df1.head()

                     name
0   Philippe Roche-Bailly
1          Louise Rousset
2           J√©r√¥me Lenoir
3         Marie Chevalier
4  Margot-Margot Maillard

In [146]:
df1.shape

(8623, 1)

In [147]:
# axis=1 pour precis√© l'odre vertical

x_features = pd.concat([df1, df], axis=1)

In [148]:
x_features.head()

                     name client_id  sex  birth
0   Philippe Roche-Bailly    c_4410    0   1967
1          Louise Rousset    c_7839    0   1975
2           J√©r√¥me Lenoir    c_1699    0   1984
3         Marie Chevalier    c_5961    0   1962
4  Margot-Margot Maillard    c_5320    1   1943

In [149]:
x_features.shape

(8623, 4)

In [150]:
x_features.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8623 entries, 0 to 8622
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       8623 non-null   object
 1   client_id  8623 non-null   object
 2   sex        8623 non-null   int8
 3   birth      8623 non-null   int64
dtypes: int64(1), int8(1), object(2)
memory usage: 535.9+ KB

In [151]:
from pivottablejs import pivot_ui

In [152]:
# "pivot_ui" permet de regarder nos donn√©es effectu√© des operation et plusieur autre chose

# pivot_ui(x_features)

In [153]:
import pygwalker as pyg

In [154]:
# pyg.walk(df)

In [164]:
# from ydata_profiling import profileReport
"""
data = pd.read_csv("ton_fichier")
profile = profileReport(data, title="Rapport d'analyse exploratoire de donn√©es", explorative=True)
profile.to_file("rapport_eda.html")
"""

'\ndata = pd.read_csv("ton_fichier")\nprofile = profileReport(data, title="Rapport d\'analyse exploratoire de donn√©es", explorative=True)\nprofile.to_file("rapport_eda.html")\n'